[
 {
   "Module": "abinit",
   "Version": "8.2.2",
   "Tag": "chem",
   "Description": "ABINIT is a package whose main program allows one to find the total energy, charge density and electronic structure of systems made of electrons and nuclei (molecules and periodic solids) within Density Functional Theory (DFT), using pseudopotentials and a planewave or wavelet basis. Homepage"
 },
 {
   "Module": "amber",
   "Version": "10",
   "Tag": "",
   "Description": "A suite of biomolecular simulation programs. It began in the late 1970's, and is maintained by an active develpment community. Homepage"
 },
 {
   "Module": "anaconda",
   "Version": "5.2.0-py2.7, 5.2.0-py3.6",
   "Tag": "lang",
   "Description": "Built to complement the rich, open source Python community, the Anaconda platform provides an enterprise-ready data analytics platform that empowers companies to adopt a modern open data science analytics architecture. Homepage"
 },
 {
   "Module": "ansys",
   "Version": "18.1, 18.2, 19.2",
   "Tag": "",
   "Description": "ANSYS simulation software enables organizations to confidently predict how their products will operate in the real world. We believe that every product is a promise of something greater. Homepage"
 },
 {
   "Module": "ansysem",
   "Version": "18.1, 18.2",
   "Tag": "",
   "Description": "ANSYS simulation software enables organizations to confidently predict how their products will operate in the real world. We believe that every product is a promise of something greater. Homepage"
 },
 {
   "Module": "ant",
   "Version": "1.10.1",
   "Tag": "devel",
   "Description": "Apache Ant is a Java library and command-line tool whose mission is to drive processes described in build files as targets and extension points dependent upon each other. The main known usage of Ant is the build of Java applications. Homepage"
 },
 {
   "Module": "ants",
   "Version": "2.2.0",
   "Tag": "data",
   "Description": "ANTs extracts information from complex datasets that include imaging. ANTs is useful for managing, interpreting and visualizing multidimensional data. Homepage"
 },
 {
   "Module": "apr",
   "Version": "1.6.2",
   "Tag": "tools",
   "Description": "The mission of the Apache Portable Runtime (APR) project is to create and maintain software libraries that provide a predictable and consistent interface to underlying platform-specific implementations. Homepage"
 },
 {
   "Module": "apr-util",
   "Version": "1.6.0",
   "Tag": "tools",
   "Description": "The mission of the Apache Portable Runtime (APR) project is to create and maintain software libraries that provide a predictable and consistent interface to underlying platform-specific implementations. Homepage"
 },
 {
   "Module": "armadillo",
   "Version": "8.300.3",
   "Tag": "numlib",
   "Description": "Armadillo is an open-source C++ linear algebra library (matrix maths) aiming towards a good balance between speed and ease of use. Integer, floating point and complex numbers are supported, as well as a subset of trigonometric and statistics functions. Homepage"
 },
 {
   "Module": "arpack-ng",
   "Version": "3.4.0",
   "Tag": "numlib",
   "Description": "ARPACK is a collection of Fortran77 subroutines designed to solve large scale eigenvalue problems. Homepage"
 },
 {
   "Module": "ascmeme",
   "Version": "devel",
   "Tag": "bio",
   "Description": "ASC+MEME is a fast motif discovery tool that is 10,000 times faster than MEME while preserving the same accuracy. Homepage"
 },
 {
   "Module": "ase",
   "Version": "3.17.0-py3",
   "Tag": "chem",
   "Description": "The Atomic Simulation Environment (ASE) is a set of tools and Python modules for setting up, manipulating, running, visualizing and analyzing atomistic simulations. Homepage"
 },
 {
   "Module": "aspera-connect",
   "Version": "3.8.1",
   "Tag": "tools",
   "Description": "Connect is an install-on-demand Web browser plug-in that facilitates high-speed uploads and downloads with an Aspera transfer server. Homepage"
 },
 {
   "Module": "augustus",
   "Version": "3.3.2",
   "Tag": "bio",
   "Description": "AUGUSTUS is a program to find genes and their structures in one or more genomes. Homepage"
 },
 {
   "Module": "autotools",
   "Version": "20150215",
   "Tag": "devel",
   "Description": "This bundle collect the standard GNU build tools: Autoconf, Automake and libtool Homepage"
 },
 {
   "Module": "bamtools",
   "Version": "2.5.1",
   "Tag": "bio",
   "Description": "BamTools provides both a programmer's API and an end-user's toolkit for handling BAM files. Homepage"
 },
 {
   "Module": "bart",
   "Version": "1.0.1",
   "Tag": "bio",
   "Description": "BART (Binding Analysis for Regulation of Transcription) is a bioinformatics tool for predicting functional transcription factors (TFs) that bind at genomic cis-regulatory regions to regulate gene expression in the human or mouse genomes, given a query gene set or a ChIP-seq dataset as input. Homepage"
 },
 {
   "Module": "bcftools",
   "Version": "1.3.1, 1.9",
   "Tag": "bio",
   "Description": "BCFtools is a set of utilities that manipulate variant calls in the Variant Call Format (VCF) and its binary counterpart BCF Homepage"
 },
 {
   "Module": "bcl2fastq2",
   "Version": "2.20.0",
   "Tag": "bio",
   "Description": "bcl2fastq Conversion Software both demultiplexes data and converts BCL files generated by Illumina sequencing systems to standard FASTQ file formats for downstream analysis. Homepage"
 },
 {
   "Module": "bedops",
   "Version": "2.4.1",
   "Tag": "bio",
   "Description": "BEDOPS is an open-source command-line toolkit that performs highly efficient and scalable Boolean and other set operations, statistical calculations, archiving, conversion and other management of genomic data of arbitrary scale. Homepage"
 },
 {
   "Module": "bedtools",
   "Version": "2.26.0",
   "Tag": "bio",
   "Description": "The BEDTools utilities allow one to address common genomics tasks such as finding feature overlaps and computing coverage. The utilities are largely based on four widely-used file formats: BED, GFF/GTF, VCF, and SAM/BAM. Homepage"
 },
 {
   "Module": "berkeley_db",
   "Version": "6.2.32",
   "Tag": "tools",
   "Description": "Berkeley DB is a family of embedded key-value database libraries providing scalable high-performance data management services to applications. Homepage"
 },
 {
   "Module": "bicseq2-norm",
   "Version": "0.2.4",
   "Tag": "bio",
   "Description": "BICseq2 is an algorithm developed for the normalization of high-throughput sequencing (HTS) data and detect copy number variations (CNV) in the genome. BICseq2 can be used for detecting CNVs with or without a control genome. BICseq2-norm is for normalizing potential biases in the sequencing data. Homepage"
 },
 {
   "Module": "bicseq2-seg",
   "Version": "0.7.2",
   "Tag": "bio",
   "Description": "BICseq2 is an algorithm developed for the normalization of high-throughput sequencing (HTS) data and detect copy number variations (CNV) in the genome. BICseq2 can be used for detecting CNVs with or without a control genome. BICseq2-seg is for detecting CNVs based on the normalized data given by BICseq2-norm. Homepage"
 },
 {
   "Module": "binutils",
   "Version": "2.28",
   "Tag": "tools",
   "Description": "binutils: GNU binary utilities Homepage"
 },
 {
   "Module": "bioconda",
   "Version": "py2.7, py3.6",
   "Tag": "bio",
   "Description": "Bioconda is a channel for the conda package manager specializing in bioinformatics software. Homepage"
 },
 {
   "Module": "bioperl",
   "Version": "1.7.1",
   "Tag": "bio",
   "Description": "Bioperl is the product of a community effort to produce Perl code which is useful in biology. Examples include Sequence objects, Alignment objects and database searching objects. Homepage"
 },
 {
   "Module": "biopython",
   "Version": "1.70-py2",
   "Tag": "bio",
   "Description": "Biopython is a set of freely available tools for biological computation written in Python by an international team of developers. It is a distributed collaborative effort to develop Python libraries and applications which address the needs of current and future work in bioinformatics. Homepage"
 },
 {
   "Module": "bismark",
   "Version": "0.17.0",
   "Tag": "bio",
   "Description": "A tool to map bisulfite converted sequence reads and determine cytosine methylation states Homepage"
 },
 {
   "Module": "blast",
   "Version": "2.6.0",
   "Tag": "bio",
   "Description": "Basic Local Alignment Search Tool, or BLAST, is an algorithm for comparing primary biological sequence information, such as the amino-acid sequences of different proteins or the nucleotides of DNA sequences. Homepage"
 },
 {
   "Module": "blender",
   "Version": "2.78c",
   "Tag": "vis",
   "Description": "Blender is the free and open source 3D creation suite. It supports the entirety of the 3D pipeline-modeling, rigging, animation, simulation, rendering, compositing and motion tracking, even video editing and game creation. Homepage"
 },
 {
   "Module": "blitz++",
   "Version": "1.0.1",
   "Tag": "lib",
   "Description": "Blitz++ is a (LGPLv3+) licensed meta-template library for array manipulation in C++ with a speed comparable to Fortran implementations, while preserving an object-oriented interface Homepage"
 },
 {
   "Module": "boost",
   "Version": "1.54.0, 1.60.0-py2, 1.60.0-py3, 1.60.0, 1.66.0-py2, 1.66.0, 1.68.0-py3, 1.68.0",
   "Tag": "devel",
   "Description": "Boost provides free peer-reviewed portable C++ source libraries. Homepage"
 },
 {
   "Module": "bowtie2",
   "Version": "2.1.0, 2.2.9",
   "Tag": "bio",
   "Description": "Bowtie 2 is an ultrafast and memory-efficient tool for aligning sequencing reads to long reference sequences. It is particularly good at aligning reads of about 50 up to 100s or 1,000s of characters, and particularly good at aligning to relatively long (e.g. mammalian) genomes. Bowtie 2 indexes the genome with an FM Index to keep its memory footprint small: for the human genome, its memory footprint is typically around 3.2 GB. Bowtie 2 supports gapped, local, and paired-end alignment modes. Homepage"
 },
 {
   "Module": "bwa",
   "Version": "0.7.15, 0.7.17",
   "Tag": "bio",
   "Description": "Burrows-Wheeler Aligner (BWA) is an efficient program that aligns relatively short nucleotide sequences against a long reference sequence such as the human genome. Homepage"
 },
 {
   "Module": "bzip2",
   "Version": "1.0.6",
   "Tag": "tools",
   "Description": "bzip2 is a freely available, patent free, high-quality data compressor. It typically compresses files to within 10% to 15% of the best available techniques (the PPM family of statistical compressors), whilst being around twice as fast at compression and six times faster at decompression. Homepage"
 },
 {
   "Module": "cd-hit",
   "Version": "4.6.7",
   "Tag": "bio",
   "Description": "CD-HIT is a very widely used program for clustering and comparing protein or nucleotide sequences. Homepage"
 },
 {
   "Module": "cellprofiler",
   "Version": "2.2.0, 3.0.0",
   "Tag": "bio",
   "Description": "CellProfiler is an image processing package to generate morphometric measurements. Homepage"
 },
 {
   "Module": "cellranger",
   "Version": "2.1.1, 2.2.0, 3.0.2",
   "Tag": "bio",
   "Description": "A set of analysis piplines that perform sample demultiplexing, barcode processing, and single cell 3' gene counting. Homepage"
 },
 {
   "Module": "cesm",
   "Version": "1.2.2",
   "Tag": "geo",
   "Description": "CESM is a fully-coupled, community, global climate model that provides state-of-the-art computer simulations of the Earth's past, present, and future climate states. Homepage"
 },
 {
   "Module": "chemps2",
   "Version": "1.8",
   "Tag": "chem",
   "Description": "CheMPS2 is a scientific library which contains a spin-adapted implementation of the density matrix renormalization group (DMRG) for ab initio quantum chemistry. Homepage"
 },
 {
   "Module": "circos",
   "Version": "0.69.5",
   "Tag": "bio",
   "Description": "Circos is a software package for visualizing data and information. It visualizes data in a circular layout - this makes Circos ideal for exploring relationships between objects or positions. Homepage"
 },
 {
   "Module": "clearcut",
   "Version": "1.3.0",
   "Tag": "bio",
   "Description": "Clearcut is the reference implementation for the Relaxed Neighbor Joining (RNJ) algorithm by J. Evans, L. Sheneman, and J. Foster from the Initiative for Bioinformatics and Evolutionary Studies (IBEST) at the University of Idaho. Homepage"
 },
 {
   "Module": "clhep",
   "Version": "2.1.1.0",
   "Tag": "numlib",
   "Description": "The CLHEP project is intended to be a set of HEP-specific foundation and utility classes such as random generators, physics vectors, geometry and linear algebra. CLHEP is structured in a set of packages independent of any external package. Homepage"
 },
 {
   "Module": "cloudcompare",
   "Version": "2.8.1",
   "Tag": "vis",
   "Description": "CloudCompare is a 3D point cloud (and triangular mesh) processing software. It has been originally designed to perform comparison between two dense 3D points clouds (such as the ones acquired with a laser scanner) or between a point cloud and a triangular mesh. Homepage"
 },
 {
   "Module": "cmake",
   "Version": "3.5.2, 3.6.1, 3.12.3",
   "Tag": "devel",
   "Description": "CMake, the cross-platform, open-source build system. CMake is a family of tools designed to build, test and package software. Homepage"
 },
 {
   "Module": "codeblocks",
   "Version": "17.12",
   "Tag": "lang",
   "Description": "Code::Blocks is a free C, C++ and Fortran IDE built to meet the most demanding needs of its users. It is designed to be very extensible and fully configurable. Homepage"
 },
 {
   "Module": "cp-analyst",
   "Version": "2.2.1",
   "Tag": "bio",
   "Description": "CellProfiler Analyst (CPA) allows interactive exploration and analysis of data, particularly from high-throughput, image-based experiments. Included is a supervised machine learning system which can be trained to recognize complicated and subtle phenotypes, for automatic scoring of millions of cells. CellProfiler is an image processing package to generate morphometric measurements. Homepage"
 },
 {
   "Module": "cp2k",
   "Version": "5.1",
   "Tag": "chem",
   "Description": "CP2K is a freely available (GPL) program, written in Fortran 95, to perform atomistic and molecular simulations of solid state, liquid, molecular and biological systems. It provides a general framework for different methods such as e.g. density functional theory (DFT) using a mixed Gaussian and plane waves approach (GPW), and classical pair and many-body potentials. Homepage"
 },
 {
   "Module": "cromwell",
   "Version": "30.1",
   "Tag": "tools",
   "Description": "Cromwell is a Workflow Management System geared towards scientific workflows. Homepage"
 },
 {
   "Module": "cuda",
   "Version": "8.0.61, 9.0.176, 9.2.148",
   "Tag": "system",
   "Description": "CUDA (formerly Compute Unified Device Architecture) is a parallel computing platform and programming model created by NVIDIA and implemented by the graphics processing units (GPUs) that they produce. CUDA gives developers access to the virtual instruction set and memory of the parallel computational elements in CUDA GPUs. Homepage"
 },
 {
   "Module": "cudnn",
   "Version": "6.0, 7.1.1, 7.2.1.38, 7.4.1.5",
   "Tag": "numlib",
   "Description": "The NVIDIA CUDA Deep Neural Network library (cuDNN) is a GPU-accelerated library of primitives for deep neural networks. Homepage"
 },
 {
   "Module": "curl",
   "Version": "7.53.1",
   "Tag": "tools",
   "Description": "libcurl is a free and easy-to-use client-side URL transfer library, supporting DICT, FILE, FTP, FTPS, Gopher, HTTP, HTTPS, IMAP, IMAPS, LDAP, LDAPS, POP3, POP3S, RTMP, RTSP, SCP, SFTP, SMTP, SMTPS, Telnet and TFTP. libcurl supports SSL certificates, HTTP POST, HTTP PUT, FTP uploading, HTTP form based upload, proxies, cookies, user+password authentication (Basic, Digest, NTLM, Negotiate, Kerberos), file transfer resume, http proxy tunneling and more. Homepage"
 },
 {
   "Module": "cushaw3",
   "Version": "3.0.3",
   "Tag": "bio",
   "Description": "CUSHAW is a well-established leading next-generation sequencing read alignment software package based on multi-core and many-core computing. Homepage"
 },
 {
   "Module": "cutadapt",
   "Version": "1.16",
   "Tag": "bio",
   "Description": "Cutadapt finds and removes adapter sequences, primers, poly-A tails and other types of unwanted sequence from your high-throughput sequencing reads. Homepage"
 },
 {
   "Module": "cytoscape",
   "Version": "3.6.1",
   "Tag": "tools",
   "Description": "Cytoscape is an open source software platform for visualizing complex networks and integrating these with any type of attribute data. Homepage"
 },
 {
   "Module": "danpos",
   "Version": "2.2.2",
   "Tag": "bio",
   "Description": "Danpos is a toolkit for Dynamic Analysis of Nucleosome and Protein Occupancy by Sequencing, version 2 Homepage"
 },
 {
   "Module": "ddd",
   "Version": "3.3.12",
   "Tag": "vis",
   "Description": "DDD is a graphical front-end for command-line debuggers such as GDB, DBX, WDB, Ladebug, JDB, XDB, the Perl debugger, the bash debugger bashdb, the GNU Make debugger remake, or the Python debugger pydb. Homepage"
 },
 {
   "Module": "deeptools",
   "Version": "2.5.3",
   "Tag": "bio",
   "Description": "deepTools contains useful modules to process the mapped reads data for multiple quality checks, creating normalized coverage files in standard bedGraph and bigWig file formats, that allow comparison between different files (for example, treatment and control). Finally, using such normalized and standardized files, deepTools can create many publication-ready visualizations to identify enrichments and for functional annotations of the genome. Homepage"
 },
 {
   "Module": "diamond",
   "Version": "0.9.13",
   "Tag": "bio",
   "Description": "DIAMOND is a sequence aligner for protein and translated DNA searches and functions as a drop-in replacement for the NCBI BLAST software tools. It is suitable for protein-protein search as well as DNA-protein search on short reads and longer sequences including contigs and assemblies, providing a speedup of BLAST ranging up to x20,000. Homepage"
 },
 {
   "Module": "doxygen",
   "Version": "1.8.13",
   "Tag": "devel",
   "Description": "Doxygen is a documentation system for C++, C, Java, Objective-C, Python, IDL (Corba and Microsoft flavors), Fortran, VHDL, PHP, C#, and to some extent D. Homepage"
 },
 {
   "Module": "dragonn",
   "Version": "2018",
   "Tag": "math",
   "Description": "DragoNN is a toolkit to learn how to model and interpret regulatory sequence data using deep learning. Homepage"
 },
 {
   "Module": "eclipse",
   "Version": "committers, oxygen-c++, oxygen-java",
   "Tag": "tools",
   "Description": "Eclipse provides IDEs and platforms for many programming languages. This module includes Java support. Homepage"
 },
 {
   "Module": "eigen",
   "Version": "3.3.3",
   "Tag": "math",
   "Description": "Eigen is a C++ template library for linear algebra: matrices, vectors, numerical solvers, and related algorithms. Homepage"
 },
 {
   "Module": "eigensoft",
   "Version": "6.1.4",
   "Tag": "bio",
   "Description": "The EIGENSOFT package combines functionality from our population genetics methods (Patterson et al. 2006) and our EIGENSTRAT stratification correction method (Price et al. 2006). The EIGENSTRAT method uses principal components analysis to explicitly model ancestry differences between cases and controls along continuous axes of variation; the resulting correction is specific to a candidate marker’s variation in frequency across ancestral populations, minimizing spurious associations while maximizing power to detect true associations. The EIGENSOFT package has a built-in plotting script and supports multiple file formats and quantitative phenotypes. Homepage"
 },
 {
   "Module": "emboss",
   "Version": "6.6.0",
   "Tag": "bio",
   "Description": "EMBOSS is 'The European Molecular Biology Open Software Suite'. EMBOSS is a free Open Source software analysis package specially developed for the needs of the molecular biology (e.g. EMBnet) user community. Homepage"
 },
 {
   "Module": "epacts",
   "Version": "3.3.0",
   "Tag": "tools",
   "Description": "EPACTS (Efficient and Parallelizable Association Container Toolbox) is a versatile software pipeline to perform various statistical tests for identifying genome-wide association from sequence data through a user-friendly interface, both to scientific analysts and to method developers. Homepage"
 },
 {
   "Module": "epic",
   "Version": "0.2.9",
   "Tag": "bio",
   "Description": "epic is a software package for finding medium to diffusely enriched domains in chip-seq data. It is a fast, parallel and memory-efficient implementation of the popular SICER algorithm. Homepage"
 },
 {
   "Module": "exonerate",
   "Version": "2.2.0, 2.4.0",
   "Tag": "bio",
   "Description": "Exonerate is a generic tool for pairwise sequence comparison. It allows you to align sequences using a many alignment models, using either exhaustive dynamic programming, or a variety of heuristics. Homepage"
 },
 {
   "Module": "fasta",
   "Version": "36.3.5e",
   "Tag": "bio",
   "Description": "The FASTA programs find regions of local or global (new) similarity between protein or DNA sequences, either by searching Protein or DNA databases, or by identifying local duplications within a sequence. Homepage"
 },
 {
   "Module": "fastqc",
   "Version": "0.11.5",
   "Tag": "bio",
   "Description": "FastQC is a Java application which takes a FastQ file and runs a series of tests on it to generate a comprehensive QC report. Homepage"
 },
 {
   "Module": "fastx-toolkit",
   "Version": "0.0.14",
   "Tag": "bio",
   "Description": "The FASTX-Toolkit is a collection of command line tools for Short-Reads FASTA/FASTQ files preprocessing. Homepage"
 },
 {
   "Module": "febio",
   "Version": "2.8.0, 2.8.5",
   "Tag": "cae",
   "Description": "FEBio is a nonlinear finite element solver that is specifically designed for biomechanics and biophysics applications. Homepage"
 },
 {
   "Module": "fenics",
   "Version": "20180100",
   "Tag": "cae",
   "Description": "Fenics is an open-source computing platform for solving partial differential equations. Homepage"
 },
 {
   "Module": "ffmpeg",
   "Version": "3.3.4",
   "Tag": "vis",
   "Description": "A complete, cross-platform solution to record, convert and stream audio and video. Homepage"
 },
 {
   "Module": "fftw",
   "Version": "3.3.6",
   "Tag": "numlib",
   "Description": "FFTW is a C subroutine library for computing the discrete Fourier transform (DFT) in one or more dimensions, of arbitrary input size, and of both real and complex data. Homepage"
 },
 {
   "Module": "fgsl",
   "Version": "1.1.0",
   "Tag": "numlib",
   "Description": "FGSL: A Fortran interface to the GNU Scientific Library Homepage"
 },
 {
   "Module": "fiji",
   "Version": "1.51",
   "Tag": "tools",
   "Description": "Fiji is an image processing distribution of ImageJ, bundling a lot of plugins which facilitate scientific image analysis. Homepage"
 },
 {
   "Module": "fltk",
   "Version": "1.3.4",
   "Tag": "vis",
   "Description": "FLTK is a cross-platform C++ GUI toolkit for UNIX/Linux (X11), Microsoft Windows, and MacOS X. FLTK provides modern GUI functionality without the bloat and supports 3D graphics via OpenGL and its built-in GLUT emulation. Homepage"
 },
 {
   "Module": "fluent",
   "Version": "18.1, 18.2",
   "Tag": "",
   "Description": "ANSYS simulation software enables organizations to confidently predict how their products will operate in the real world. Homepage"
 },
 {
   "Module": "freebayes",
   "Version": "0.9.9",
   "Tag": "bio",
   "Description": "FreeBayes is a Bayesian genetic variant detector designed to find small polymorphisms, specifically SNPs (single-nucleotide polymorphisms), indels (insertions and deletions), MNPs (multi-nucleotide polymorphisms), and complex events (composite insertion and substitution events) smaller than the length of a short-read sequencing alignment. Homepage"
 },
 {
   "Module": "fsa",
   "Version": "1.15.9",
   "Tag": "bio",
   "Description": "FSA:Fast Statistical Alignment, is a probabilistic multiple sequence alignment algorithm which uses a distance-based approach to aligning homologous protein, RNA or DNA sequences. Homepage"
 },
 {
   "Module": "fsl",
   "Version": "6.0.0_former, 6.0.0_test, 6.0.0",
   "Tag": "bio",
   "Description": "FSL is a comprehensive library of analysis tools for FMRI, MRI and DTI brain imaging data. Homepage"
 },
 {
   "Module": "gatk",
   "Version": "3.8.1.0, 4.0.0.0",
   "Tag": "bio",
   "Description": "The Genome Analysis Toolkit or GATK is a software package developed at the Broad Institute to analyse next-generation resequencing data. The toolkit offers a wide variety of tools, with a primary focus on variant discovery and genotyping as well as strong emphasis on data quality assurance. Its robust architecture, powerful processing engine and high-performance computing features make it capable of taking on projects of any size. Homepage"
 },
 {
   "Module": "gaussian",
   "Version": "g16, grads16",
   "Tag": "chem",
   "Description": "Gaussian is a suite of electronic-structure codes. Homepage"
 },
 {
   "Module": "gcc",
   "Version": "system, 5.4.0, 7.1.0",
   "Tag": "compiler",
   "Description": "The GNU Compiler Collection includes front ends for C, C++, Objective-C, Fortran, Java, and Ada, as well as libraries for these languages (libstdc++, libgcj,...). Homepage"
 },
 {
   "Module": "gcccuda",
   "Version": "5.4.0",
   "Tag": "toolchain",
   "Description": "GNU Compiler Collection (GCC) based compiler toolchain, along with CUDA toolkit."
 },
 {
   "Module": "gcloud-sdk",
   "Version": "196.0.0",
   "Tag": "tools",
   "Description": "The Cloud SDK is a set of tools for Cloud Platform. It contains gcloud, gsutil, and bq, which you can use to access Google Compute Engine, Google Cloud Storage, Google BigQuery, and other products and services from the command-line. Homepage"
 },
 {
   "Module": "gd",
   "Version": "2.66",
   "Tag": "bio",
   "Description": "GD.pm - Interface to Gd Graphics Library Homepage"
 },
 {
   "Module": "gdal",
   "Version": "2.1.0, 2.2.0",
   "Tag": "data",
   "Description": "GDAL is a translator library for raster geospatial data formats that is released under an X/MIT style Open Source license by the Open Source Geospatial Foundation. As a library, it presents a single abstract data model to the calling application for all supported formats. It also comes with a variety of useful commandline utilities for data translation and processing. Homepage"
 },
 {
   "Module": "gdc-client",
   "Version": "1.3.0",
   "Tag": "bio",
   "Description": "The gdc-client provides several convenience functions over the GDC API which provides general download/upload via HTTPS. Homepage"
 },
 {
   "Module": "geany",
   "Version": "1.33",
   "Tag": "tools",
   "Description": "Geany is a text editor using the GTK+ toolkit with basic features of an integrated development environment. Homepage"
 },
 {
   "Module": "genometools",
   "Version": "1.5.10",
   "Tag": "bio",
   "Description": "The GenomeTools genome analysis system is a free collection of bioinformatics tools (in the realm of genome informatics) combined into a single binary named gt. It is based on a C library named “libgenometools” which consists of several modules. Homepage"
 },
 {
   "Module": "gftp",
   "Version": "2.0.19",
   "Tag": "tools",
   "Description": "gFTP is a free multithreaded file transfer client for *NIX based machines. Homepage"
 },
 {
   "Module": "git",
   "Version": "2.4.1",
   "Tag": "tools",
   "Description": "Git is a free and open source distributed version control system designed to handle everything from small to very large projects with speed and efficiency. Homepage"
 },
 {
   "Module": "glew",
   "Version": "2.1.0",
   "Tag": "lib",
   "Description": "The OpenGL Extension Wrangler Library (GLEW) is a cross-platform open-source C/C++ extension loading library. GLEW provides efficient run-time mechanisms for determining which OpenGL extensions are supported on the target platform. Homepage"
 },
 {
   "Module": "globus_cli",
   "Version": "1.4.0",
   "Tag": "tools",
   "Description": "Globus CLI is a standalone application that can be installed on the user’s machine and used to access the Globus file transfer service. Homepage"
 },
 {
   "Module": "gmap-gsnap",
   "Version": "2017-11-15",
   "Tag": "bio",
   "Description": "GMAP: A Genomic Mapping and Alignment Program for mRNA and EST Sequences GSNAP: Genomic Short-read Nucleotide Alignment Program Homepage"
 },
 {
   "Module": "gmp",
   "Version": "6.1.0",
   "Tag": "math",
   "Description": "GMP is a free library for arbitrary precision arithmetic, operating on signed integers, rational numbers, and floating point numbers. Homepage"
 },
 {
   "Module": "gmvapich2",
   "Version": "7.1.0_2.3",
   "Tag": "toolchain",
   "Description": "GNU Compiler Collection (GCC) based compiler toolchain, including MVAPICH2 for MPI support."
 },
 {
   "Module": "gmvolf",
   "Version": "7.1.0_2.3",
   "Tag": "toolchain",
   "Description": "GNU Compiler Collection (GCC) based compiler toolchain, including OpenMPI for MPI support, OpenBLAS (BLAS and LAPACK support), FFTW and ScaLAPACK."
 },
 {
   "Module": "gnuplot",
   "Version": "5.2.2",
   "Tag": "vis",
   "Description": "Portable interactive, function plotting utility Homepage"
 },
 {
   "Module": "go",
   "Version": "1.8.1",
   "Tag": "lang",
   "Description": "Go is an open source programming language that makes it easy to build simple, reliable, and efficient software. Homepage"
 },
 {
   "Module": "gobject-introspection",
   "Version": "1.48.0",
   "Tag": "devel",
   "Description": "GObject introspection is a middleware layer between C libraries (using GObject) and language bindings. The C library can be scanned at compile time and generate a metadata file, in addition to the actual native C library. Then at runtime, language bindings can read this metadata and automatically provide bindings to call into the C library. Homepage"
 },
 {
   "Module": "gompi",
   "Version": "system_2.1.3, system_2.1.5, 5.4.0_2.1.5, 7.1.0_2.1.5",
   "Tag": "toolchain",
   "Description": "GNU Compiler Collection (GCC) based compiler toolchain, including OpenMPI for MPI support."
 },
 {
   "Module": "google-api",
   "Version": "1.6.6",
   "Tag": "tools",
   "Description": "Google APIs give you programmatic access to Google Maps, Google Drive, YouTube, and many other Google products. Homepage"
 },
 {
   "Module": "goolf",
   "Version": "5.4.0_2.1.2, 5.4.0_2.1.5, 7.1.0_2.1.5",
   "Tag": "toolchain",
   "Description": "GNU Compiler Collection (GCC) based compiler toolchain, including OpenMPI for MPI support, OpenBLAS (BLAS and LAPACK support), FFTW and ScaLAPACK."
 },
 {
   "Module": "gparallel",
   "Version": "20170822",
   "Tag": "tools",
   "Description": "GNU parallel is a shell tool for executing jobs in parallel using one or more computers. Homepage"
 },
 {
   "Module": "gperf",
   "Version": "3.0.4",
   "Tag": "base",
   "Description": "None"
 },
 {
   "Module": "grace",
   "Version": "5.1.25",
   "Tag": "vis",
   "Description": "Grace is a WYSIWYG 2D plotting tool for X Windows System and Motif. Homepage"
 },
 {
   "Module": "grib_api",
   "Version": "1.16.0",
   "Tag": "data",
   "Description": "The ECMWF GRIB API is an application program interface accessible from C, FORTRAN and Python programs developed for encoding and decoding WMO FM-92 GRIB edition 1 and edition 2 messages. A useful set of command line tools is also provided to give quick access to GRIB messages. Homepage"
 },
 {
   "Module": "gromacs",
   "Version": "5.1.2",
   "Tag": "chem",
   "Description": "GROMACS is a versatile package to perform molecular dynamics, i.e. simulate the Newtonian equations of motion for systems with hundreds to millions of particles. Homepage"
 },
 {
   "Module": "gsl",
   "Version": "2.3, 2.4",
   "Tag": "numlib",
   "Description": "The GNU Scientific Library (GSL) is a numerical library for C and C++ programmers. The library provides a wide range of mathematical routines such as random number generators, special functions and least-squares fitting. Homepage"
 },
 {
   "Module": "gurobi",
   "Version": "7.0.2, 8.0.1",
   "Tag": "",
   "Description": "The Gurobi Optimizer is a state-of-the-art solver for mathematical programming. The solvers in the Gurobi Optimizer were designed from the ground up to exploit modern architectures and multi-core processors, using the most advanced implementations of the latest algorithms. Homepage"
 },
 {
   "Module": "hdf5",
   "Version": "1.8.16, 1.8.19, 1.10.4",
   "Tag": "data",
   "Description": "HDF5 is a unique technology suite that makes possible the management of extremely large and complex data collections. Homepage"
 },
 {
   "Module": "hexrd",
   "Version": "jb-0.3.x, jb-0.5.6",
   "Tag": "phys",
   "Description": "HEXRD provides a collection of resources for analysis of x-ray diffraction data, especially high-energy x-ray diffraction. HEXRD is comprised of a library and API for writing scripts, a command line interface, and an interactive graphical user interface. Homepage"
 },
 {
   "Module": "hic-pro",
   "Version": "2.9.0",
   "Tag": "bio",
   "Description": "HiC-Pro is an optimized and flexible pipeline for Hi-C data processing. Homepage"
 },
 {
   "Module": "hisat2",
   "Version": "2.0.5, 2.1.0",
   "Tag": "bio",
   "Description": "HISAT2 is a fast and sensitive alignment program for mapping next-generation sequencing reads (both DNA and RNA) against the general human population (as well as against a single reference genome). Homepage"
 },
 {
   "Module": "homer",
   "Version": "4.10",
   "Tag": "tools",
   "Description": "HOMER (Hypergeometric Optimization of Motif EnRichment) is a suite of tools for Motif Discovery and ChIP-Seq analysis. It is a collection of command line programs for unix-style operating systems written in mostly perl and c++. Homer was primarily written as a de novo motif discovery algorithm that is well suited for finding 8-12 bp motifs in large scale genomics data. Homepage"
 },
 {
   "Module": "hoomd",
   "Version": "2.3.5",
   "Tag": "chem",
   "Description": "HOOMD-blue is a general-purpose particle simulation toolkit. It scales from a single CPU core to thousands of GPUs. Homepage"
 },
 {
   "Module": "htslib",
   "Version": "1.4.1, 1.7, 1.9",
   "Tag": "bio",
   "Description": "A C library for reading/writing high-throughput sequencing data. This package includes the utilities bgzip and tabix Homepage"
 },
 {
   "Module": "hydrator",
   "Version": "0.0.2",
   "Tag": "data",
   "Description": "Hydrator converts Twitter IDs into JSON files. Homepage"
 },
 {
   "Module": "hypre",
   "Version": "2.11.1",
   "Tag": "numlib",
   "Description": "Hypre is a library for solving large, sparse linear systems of equations on massively parallel computers. The problems of interest arise in the simulation codes being developed at LLNL and elsewhere to study physical phenomena in the defense, environmental, energy, and biological sciences. Homepage"
 },
 {
   "Module": "idl",
   "Version": "8.4",
   "Tag": "",
   "Description": "IDL is an interpreted programming language used to create analyses and visualizations of numerical data. Homepage"
 },
 {
   "Module": "idr",
   "Version": "2.0.2-py3",
   "Tag": "bio",
   "Description": "The IDR (Irreproducible Discovery Rate) framework is a uniﬁed approach to measure the reproducibility of ﬁndings identiﬁed from replicate experiments and provide highly stable thresholds based on reproducibility. The IDR method compares a pair of ranked lists of identifications (such as ChIP-seq peaks). Homepage"
 },
 {
   "Module": "iintelmpi",
   "Version": "16.0_16.0, 18.0_18.0",
   "Tag": "toolchain",
   "Description": "Intel C/C++ and Fortran compilers, alongside Open MPI. Homepage"
 },
 {
   "Module": "imagemagick",
   "Version": "7.0.7-0",
   "Tag": "vis",
   "Description": "ImageMagick is a software suite to create, edit, compose, or convert bitmap images Homepage"
 },
 {
   "Module": "imsl",
   "Version": "7.1.0",
   "Tag": "numlib",
   "Description": "IMSL Libraries provide optimized mathematical and statistical algorithms that can be embedded into C, C++, .NET, Java™, and Fortran applications, including many databases. IMSL enhances application performance, reliability, portability, scalability, and maintainability as well as developer productivity. Homepage"
 },
 {
   "Module": "imvapich2",
   "Version": "16.0_2.3",
   "Tag": "toolchain",
   "Description": "Intel C/C++ and Fortran compilers, alongside MVAPICH2. Homepage"
 },
 {
   "Module": "inkscape",
   "Version": "0.92.3",
   "Tag": "lib",
   "Description": "Inkscape is a free and open source professional vector graphics editor. Homepage"
 },
 {
   "Module": "intel",
   "Version": "16.0, 18.0",
   "Tag": "compiler",
   "Description": "The Intel Compilers include compilers for C, C++, and Fortran. Intel compilers also enable use of the Math Kernel Libraries and the VTune analysis tool. Homepage"
 },
 {
   "Module": "intelmpi",
   "Version": "16.0, 18.0",
   "Tag": "mpi",
   "Description": "IntelMPI from Intel Homepage"
 },
 {
   "Module": "intervene",
   "Version": "0.6.4",
   "Tag": "bio",
   "Description": "Intervene is a tool for intersection and visualization of multiple genomic region sets. Homepage"
 },
 {
   "Module": "intltool",
   "Version": "0.50.2",
   "Tag": "lang",
   "Description": "The Intltool is an internationalization tool used for extracting translatable strings from source files, collecting the extracted strings with messages from traditional source files, and merging the translations into .xml, .desktop and .oaf files. Homepage"
 },
 {
   "Module": "irfinder",
   "Version": "1.2.4",
   "Tag": "bio",
   "Description": "IRFinder is a tool for detecting intron retention from RNA-Seq experiments. Homepage"
 },
 {
   "Module": "jags",
   "Version": "3.4.0",
   "Tag": "math",
   "Description": "JAGS is Just Another Gibbs Sampler. It is a program for analysis of Bayesian hierarchical models using Markov Chain Monte Carlo (MCMC) simulation Homepage"
 },
 {
   "Module": "jasper",
   "Version": "1.900.1, 2.0.12",
   "Tag": "vis",
   "Description": "The JasPer Project is an open-source initiative to provide a free software-based reference implementation of the codec specified in the JPEG-2000 Part-1 standard. Homepage"
 },
 {
   "Module": "java",
   "Version": "1.8.0",
   "Tag": "lang",
   "Description": "Java Platform, Standard Edition (Java SE) lets you develop and deploy Java applications on desktops and servers. Homepage"
 },
 {
   "Module": "jcuda",
   "Version": "0.9.2",
   "Tag": "bio",
   "Description": "Java bindings for NVIDIA CUDA and related libraries. Homepage"
 },
 {
   "Module": "jtreeview",
   "Version": "3",
   "Tag": "vis",
   "Description": "TreeView is an open-source Java app for visualizing large data matrices. It can load a dataset, cluster it, browse it, customize its appearance and export it (or parts of it) into a figure. Homepage"
 },
 {
   "Module": "juicer",
   "Version": "1.9.9",
   "Tag": "bio",
   "Description": "Juicer is a one-click pipeline for processing terabase scale Hi-C datasets. Homepage"
 },
 {
   "Module": "julia",
   "Version": "0.6.0, 1.0.2, 1.0.3, 1.1.0",
   "Tag": "lang",
   "Description": "Julia is a high-level, high-performance dynamic programming language for numerical computing. It provides a sophisticated compiler, distributed parallel execution, numerical accuracy, and an extensive mathematical function library. Homepage"
 },
 {
   "Module": "junit",
   "Version": "4.12",
   "Tag": "devel",
   "Description": "A programmer-oriented testing framework for Java. Homepage"
 },
 {
   "Module": "kallisto",
   "Version": "0.44.0",
   "Tag": "bio",
   "Description": "Kallisto is a program for quantifying abundances of transcripts from RNA-Seq data, or more generally of target sequences using high-throughput sequencing reads. It is based on the novel idea of pseudoalignment for rapidly determining the compatibility of reads with targets, without the need for alignment. Homepage"
 },
 {
   "Module": "keras",
   "Version": "2.0.8-tf2",
   "Tag": "lib",
   "Description": "Keras is a high-level neural networks API, written in Python and capable of running on top of TensorFlow, CNTK, or Theano. This version runs on top of Tensorflow Homepage"
 },
 {
   "Module": "kraken",
   "Version": "0.10.5",
   "Tag": "bio",
   "Description": "Kraken is a system for assigning taxonomic labels to short DNA sequences, usually obtained through metagenomic studies. Homepage"
 },
 {
   "Module": "lame",
   "Version": "3.99.5",
   "Tag": "data",
   "Description": "LAME is a high quality MPEG Audio Layer III (MP3) encoder licensed under the LGPL. Homepage"
 },
 {
   "Module": "LAME",
   "Version": "3.99.5",
   "Tag": "data",
   "Description": "LAME is a high quality MPEG Audio Layer III (MP3) encoder licensed under the LGPL. Homepage"
 },
 {
   "Module": "lammps",
   "Version": "20180822",
   "Tag": "chem",
   "Description": "LAMMPS is a classical molecular dynamics code, and an acronym for Large-scale Atomic/Molecular Massively Parallel Simulator. Homepage"
 },
 {
   "Module": "lapack",
   "Version": "3.7.0",
   "Tag": "numlib",
   "Description": "LAPACK is written in Fortran90 and provides routines for solving systems of simultaneous linear equations, least-squares solutions of linear systems of equations, eigenvalue problems, and singular value problems. Homepage"
 },
 {
   "Module": "leda",
   "Version": "6.3",
   "Tag": "lib",
   "Description": "RStudio is a set of integrated tools designed to help you be more productive with R. LEDA is a C++ class library for efficient data types and algorithms that provide algorithmic in-depth knowledge of graph- and network problems, geometric computations, combinatorial opimization and other. Homepage"
 },
 {
   "Module": "levmar",
   "Version": "2.6",
   "Tag": "numlib",
   "Description": "Levmar is an implementation of Levenberg-Marquardt in C Homepage"
 },
 {
   "Module": "lftp",
   "Version": "4.8.4",
   "Tag": "tools",
   "Description": "lftp is a sophisticated file transfer program supporting a number of network protocols. Homepage"
 },
 {
   "Module": "libgd",
   "Version": "2.2.5",
   "Tag": "lib",
   "Description": "GD is an open source code library for the dynamic creation of images by programmers. Homepage"
 },
 {
   "Module": "libharu",
   "Version": "2.3.0",
   "Tag": "lib",
   "Description": "libHaru is a free, cross platform, open source library for generating PDF files. Homepage"
 },
 {
   "Module": "libint",
   "Version": "1.1.5, 2.4.2",
   "Tag": "chem",
   "Description": "Libint library is used to evaluate the traditional (electron repulsion) and certain novel two-body matrix elements (integrals) over Cartesian Gaussian functions used in modern atomic and molecular theory. Homepage"
 },
 {
   "Module": "libmatheval",
   "Version": "1.1.11",
   "Tag": "lib",
   "Description": "GNU libmatheval is a library (callable from C and Fortran) to parse and evaluate symbolic expressions input as text. Homepage"
 },
 {
   "Module": "libpng",
   "Version": "1.6.29",
   "Tag": "lib",
   "Description": "libpng is the official PNG reference library Homepage"
 },
 {
   "Module": "libxsmm",
   "Version": "1.8.3",
   "Tag": "math",
   "Description": "LIBXSMM is a library for small dense and small sparse matrix-matrix multiplications targeting Intel Architecture (x86). Homepage"
 },
 {
   "Module": "llvm",
   "Version": "4.0.0",
   "Tag": "compiler",
   "Description": "The LLVM Core libraries provide a modern source- and target-independent optimizer, along with code generation support for many popular CPUs (as well as some less common ones!) These libraries are built around a well specified code representation known as the LLVM intermediate representation (\"LLVM IR\"). The LLVM Core libraries are well documented, and it is particularly easy to invent your own language (or port an existing compiler) to use LLVM as an optimizer and code generator. Homepage"
 },
 {
   "Module": "longranger",
   "Version": "2.2.2",
   "Tag": "bio",
   "Description": "Long Ranger is a set of analysis pipelines that processes Chromium sequencing output to align reads and call and phase SNPs, indels, and structural variants. Homepage"
 },
 {
   "Module": "macs2",
   "Version": "2.1.2",
   "Tag": "bio",
   "Description": "MACS (Model-based Analysis of ChIP-Seq) identifies transcript factor binding sites. MACS captures the influence of genome complexity to evaluate the significance of enriched ChIP regions, and MACS improves the spatial resolution of binding sites through combining the information of both sequencing tag position and orientation. Homepage"
 },
 {
   "Module": "manta",
   "Version": "1.4.0",
   "Tag": "bio",
   "Description": "Manta calls structural variants (SVs) and indels from mapped paired-end sequencing reads. It is optimized for analysis of germline variation in small sets of individuals and somatic variation in tumor/normal sample pairs. Manta discovers, assembles and scores large-scale SVs, medium-sized indels and large insertions within a single efficient workflow. Homepage"
 },
 {
   "Module": "marge",
   "Version": "1.0",
   "Tag": "bio",
   "Description": "MARGE is a robust methodology that leverages a comprehensive library of genome-wide H3K27ac ChIP-seq profiles to predict key regulated genes and cis-regulatory regions in human or mouse. Homepage"
 },
 {
   "Module": "mathematica",
   "Version": "11.1.1",
   "Tag": "math",
   "Description": "Mathematica is a computational software program used in many scientific, engineering, mathematical and computing fields. Homepage"
 },
 {
   "Module": "matlab",
   "Version": "R2017a, R2018b",
   "Tag": "",
   "Description": ""
 },
 {
   "Module": "matlab_kernel",
   "Version": "0.15.0-py27, 0.15.0-py36",
   "Tag": "lang",
   "Description": "Provides a Matlab kernel for JupyterHub. Supported by Python 2.7 Homepage"
 },
 {
   "Module": "maven",
   "Version": "3.3.9",
   "Tag": "devel",
   "Description": "Binary maven install, Apache Maven is a software project management and comprehension tool. Based on the concept of a project object model (POM), Maven can manage a project's build, reporting and documentation from a central piece of information. Homepage"
 },
 {
   "Module": "mayavi",
   "Version": "4.5.0",
   "Tag": "vis",
   "Description": "A tool for easy and interactive visualization of data. Homepage"
 },
 {
   "Module": "meme",
   "Version": "4.10.2",
   "Tag": "bio",
   "Description": "The MEME Suite allows you to: * discover motifs using MEME, DREME (DNA only) or GLAM2 on groups of related DNA or protein sequences, * search sequence databases with motifs using MAST, FIMO, MCAST or GLAM2SCAN, * compare a motif to all motifs in a database of motifs, * associate motifs with Gene Ontology terms via their putative target genes, and * analyse motif enrichment using SpaMo or CentriMo. Homepage"
 },
 {
   "Module": "metis",
   "Version": "5.1.0",
   "Tag": "math",
   "Description": "METIS is a set of serial programs for partitioning graphs, partitioning finite element meshes, and producing fill reducing orderings for sparse matrices. The algorithms implemented in METIS are based on the multilevel recursive-bisection, multilevel k-way, and multi-constraint partitioning schemes. Homepage"
 },
 {
   "Module": "miniconda",
   "Version": "4.3.21-py3.6",
   "Tag": "lang",
   "Description": "Built to complement the rich, open source Python community, the Anaconda platform provides an enterprise-ready data analytics platform that empowers companies to adopt a modern open data science analytics architecture. Homepage"
 },
 {
   "Module": "moist",
   "Version": "1.2.3-py2",
   "Tag": "tools",
   "Description": "moist is a Python database adaptor for MySQL, MariaDB, and (eventually) Drizzle. It is a continuation of the development fork of MySQLdb, i.e. pre-2.0. Homepage"
 },
 {
   "Module": "mothur",
   "Version": "1.39.5",
   "Tag": "bio",
   "Description": "Mothur is a single piece of open-source, expandable software to fill the bioinformatics needs of the microbial ecology community. Homepage"
 },
 {
   "Module": "mpi4py",
   "Version": "3.0.0-py2.7, 3.0.0-py3.6",
   "Tag": "lib",
   "Description": "MPI for Python (mpi4py) provides bindings of the Message Passing Interface (MPI) standard for the Python programming language, allowing any Python program to exploit multiple processors. Homepage"
 },
 {
   "Module": "mummer",
   "Version": "4.0.0",
   "Tag": "bio",
   "Description": "MUMmer is a system for rapidly aligning entire genomes, whether in complete or draft form. AMOS makes use of it. Homepage"
 },
 {
   "Module": "muscle",
   "Version": "3.8.31",
   "Tag": "bio",
   "Description": "MUSCLE is one of the best-performing multiple alignment programs according to published benchmark tests, with accuracy and speed that are consistently better than CLUSTALW. MUSCLE can align hundreds of sequences in seconds. Most users learn everything they need to know about MUSCLE in a few minutes—only a handful of command-line options are needed to perform common alignment tasks. Homepage"
 },
 {
   "Module": "nasm",
   "Version": "2.12.02",
   "Tag": "lang",
   "Description": "NASM: General-purpose x86 assembler Homepage"
 },
 {
   "Module": "ncbi-vdb",
   "Version": "2.8.2",
   "Tag": "bio",
   "Description": "The SRA Toolkit and SDK from NCBI is a collection of tools and libraries for using data in the INSDC Sequence Read Archives. Homepage"
 },
 {
   "Module": "ncl",
   "Version": "6.4.0",
   "Tag": "data",
   "Description": "NCL is an interpreted language designed specifically for scientific data analysis and visualization. Homepage"
 },
 {
   "Module": "netcdf",
   "Version": "4, 4.6.2",
   "Tag": "data",
   "Description": "NetCDF (network Common Data Form) is a set of software libraries and machine-independent data formats that support the creation, access, and sharing of array-oriented scientific data. This module bundles the C++ and Fortran libaries. Homepage"
 },
 {
   "Module": "netperf",
   "Version": "2.6.0",
   "Tag": "base",
   "Description": "None"
 },
 {
   "Module": "neuron",
   "Version": "7.4",
   "Tag": "bio",
   "Description": "Empirically-based simulations of neurons and networks of neurons. Homepage"
 },
 {
   "Module": "nextflow",
   "Version": "0.26.0.4715",
   "Tag": "tools",
   "Description": "Nextflow is a reactive workflow framework and a programming DSL that eases the writing of computational pipelines with complex data. Homepage"
 },
 {
   "Module": "ngs",
   "Version": "1.3.0",
   "Tag": "bio",
   "Description": "NGS is a new, domain-specific API for accessing reads, alignments and pileups produced from Next Generation Sequencing. Homepage"
 },
 {
   "Module": "ngsplot",
   "Version": "2.61",
   "Tag": "bio",
   "Description": "ngs.plot allows easy visualization of next-generation sequencing (NGS) samples at functional genomic regions. Homepage"
 },
 {
   "Module": "nseg",
   "Version": "1.0.0",
   "Tag": "bio",
   "Description": "Nseg is used to identify low complexity sequencesi. Homepage"
 },
 {
   "Module": "ntl",
   "Version": "10.5.0",
   "Tag": "math",
   "Description": "NTL is a high-performance, portable C++ library providing data structures and algorithms for manipulating signed, arbitrary length integers, and for vectors, matrices, and polynomials over the integers and over finite fields. Homepage"
 },
 {
   "Module": "openblas",
   "Version": "0.2.19, 0.2.20",
   "Tag": "numlib",
   "Description": "OpenBLAS is an optimized BLAS library based on GotoBLAS2 1.13 BSD version. Homepage"
 },
 {
   "Module": "openbugs",
   "Version": "3.2.3",
   "Tag": "math",
   "Description": "OpenBUGS is a software application for the Bayesian analysis of complex statistical models using Markov chain Monte Carlo (MCMC) methods. Homepage"
 },
 {
   "Module": "OpenBUGS",
   "Version": "3.2.3",
   "Tag": "math",
   "Description": "OpenBUGS is a software application for the Bayesian analysis of complex statistical models using Markov chain Monte Carlo (MCMC) methods. Homepage"
 },
 {
   "Module": "openjpeg",
   "Version": "2.3.0",
   "Tag": "lib",
   "Description": "OpenJPEG is an open-source JPEG 2000 codec written in C. Homepage"
 },
 {
   "Module": "openmpi",
   "Version": "2.1.3, 2.1.5",
   "Tag": "mpi",
   "Description": "The Open MPI Project is an open source MPI-2 implementation. Homepage"
 },
 {
   "Module": "openslide",
   "Version": "3.4.1",
   "Tag": "bio",
   "Description": "OpenSlide is a C library that provides a simple interface to read whole-slide images. Homepage"
 },
 {
   "Module": "openslide-python",
   "Version": "1.1.1-py3",
   "Tag": "bio",
   "Description": "Python bindings for the OpenSlide libary Homepage"
 },
 {
   "Module": "p3dfft",
   "Version": "2.7.6",
   "Tag": "numlib",
   "Description": "P3DFFT is a library for large-scale computer simulations on parallel platforms. Homepage"
 },
 {
   "Module": "p7zip",
   "Version": "16.02",
   "Tag": "tools",
   "Description": "p7zip is a quick port of 7z.exe and 7za.exe (command line version of 7zip) for Unix. 7-Zip is a file archiver with highest compression ratio. Homepage"
 },
 {
   "Module": "paraview",
   "Version": "5.6.0",
   "Tag": "vis",
   "Description": "ParaView is a scientific parallel visualizer. Homepage"
 },
 {
   "Module": "parmetis",
   "Version": "4.0.3",
   "Tag": "numlib",
   "Description": "ParMETIS is an MPI-based parallel library that implements a variety of algorithms for partitioning unstructured graphs, meshes, and for computing fill-reducing orderings of sparse matrices. Homepage"
 },
 {
   "Module": "pcmsolver",
   "Version": "1.1.4",
   "Tag": "chem",
   "Description": "An API for the Polarizable Continuum Model. Homepage"
 },
 {
   "Module": "peakseq",
   "Version": "1.31",
   "Tag": "bio",
   "Description": "PeakSeq is a program for identifying and ranking peak regions in ChIP-Seq experiments. It takes as input, mapped reads from a ChIP-Seq experiment, mapped reads from a control experiment and outputs a file with peak regions ranked with increasing Q-values. Homepage"
 },
 {
   "Module": "perl",
   "Version": "5.24.0",
   "Tag": "lang",
   "Description": "Larry Wall's Practical Extraction and Report Language Homepage"
 },
 {
   "Module": "petsc",
   "Version": "3.10.3",
   "Tag": "numlib",
   "Description": "PETSc, pronounced PET-see (the S is silent), is a suite of data structures and routines for the scalable (parallel) solution of scientific applications modeled by partial differential equations. Homepage"
 },
 {
   "Module": "pgi",
   "Version": "17.5, 18.10",
   "Tag": "compiler",
   "Description": "C, C++, and Fortran compilers from PGI. Homepage"
 },
 {
   "Module": "picard",
   "Version": "2.1.1, 2.18.5",
   "Tag": "bio",
   "Description": "A set of tools (in Java) for working with next generation sequencing data in the BAM (http://samtools.github.io/hts-specs) format. Homepage"
 },
 {
   "Module": "platform-mpi",
   "Version": "9.01.04.03",
   "Tag": "mpi",
   "Description": "Platform MPI is an MPI-2 implementation from IBM. Homepage"
 },
 {
   "Module": "plink",
   "Version": "1.07",
   "Tag": "bio",
   "Description": "PLINK is a free, open-source whole genome association analysis toolset, designed to perform a range of basic, large-scale analyses in a computationally efficient manner. The focus of PLINK is purely on analysis of genotype/phenotype data, so there is no support for steps prior to this (e.g. study design and planning, generating genotype or CNV calls from raw data). Through integration with gPLINK and Haploview, there is some support for the subsequent visualization, annotation and storage of results. Homepage"
 },
 {
   "Module": "plumed",
   "Version": "2.4.0",
   "Tag": "chem",
   "Description": "PLUMED is an open source library for free energy calculations in molecular systems which works together with some of the most popular molecular dynamics engines. Free energy calculations can be performed as a function of many order parameters with a particular focus on biological problems, using state of the art methods such as metadynamics, umbrella sampling and Jarzynski-equation based steered MD. The software, written in C++, can be easily interfaced with both fortran and C/C++ codes. Homepage"
 },
 {
   "Module": "povray",
   "Version": "3.7.0.7",
   "Tag": "vis",
   "Description": "The Persistence of Vision Raytracer is a high-quality, Free Software tool for creating stunning three-dimensional graphics. Homepage"
 },
 {
   "Module": "proj",
   "Version": "4.9.2",
   "Tag": "lib",
   "Description": "Program proj is a standard Unix filter function which converts geographic longitude and latitude coordinates into cartesian coordinates Homepage"
 },
 {
   "Module": "prokka",
   "Version": "1.12",
   "Tag": "bio",
   "Description": "Prokka is a software tool for the rapid annotation of prokaryotic genomes. Homepage"
 },
 {
   "Module": "pslib",
   "Version": "0.4.5",
   "Tag": "tools",
   "Description": "pslib is a C-library to create PostScript files on the fly. It offers many drawing primitives, inclusion of png and eps images and a very sophisticated text rendering including hyphenation, kerning and ligatures. Homepage"
 },
 {
   "Module": "pybind11",
   "Version": "2.2.4-py3",
   "Tag": "lib",
   "Description": "pybind11 is a lightweight header-only library that exposes C++ types in Python and vice versa, mainly to create Python bindings of existing C++ code. Homepage"
 },
 {
   "Module": "python",
   "Version": "2.7.14, 3.6.8",
   "Tag": "lang",
   "Description": "Python is a programming language that lets you work more effectively. Homepage"
 },
 {
   "Module": "pytorch",
   "Version": "0.2.0-py3, 0.2.0",
   "Tag": "lib",
   "Description": "Pytorch is a python deep learning framework using tensors and dynamic neural networks with strong GPU acceleration. Homepage"
 },
 {
   "Module": "qiime",
   "Version": "1.9.1",
   "Tag": "bio",
   "Description": "QIIME is an open-source bioinformatics pipeline for performing microbiome analysis from raw DNA sequencing data. Homepage"
 },
 {
   "Module": "qt5",
   "Version": "5.9.1",
   "Tag": "devel",
   "Description": "Qt is a comprehensive cross-platform C++ application framework. Homepage"
 },
 {
   "Module": "quantumespresso",
   "Version": "5.4.0, 6.1, 6.3",
   "Tag": "chem",
   "Description": "Quantum ESPRESSO is an integrated suite of computer codes for electronic-structure calculations and materials modeling at the nanoscale. It is based on density-functional theory, plane waves, and pseudopotentials (both norm-conserving and ultrasoft). Homepage"
 },
 {
   "Module": "qwt",
   "Version": "6.1.2",
   "Tag": "lib",
   "Description": "The Qwt library contains GUI Components and utility classes which are primarily useful for programs with a technical background. Homepage"
 },
 {
   "Module": "R",
   "Version": "3.2.1, 3.3.0_test, 3.3.0, 3.4.0, 3.4.3, 3.5.1_test, 3.5.1",
   "Tag": "lang",
   "Description": "R is a free software environment for statistical computing and graphics. Homepage"
 },
 {
   "Module": "raxml",
   "Version": "8.2.4",
   "Tag": "bio",
   "Description": "RAxML search algorithm for maximum likelihood based inference of phylogenetic trees. Homepage"
 },
 {
   "Module": "rdp-classifier",
   "Version": "2.12",
   "Tag": "bio",
   "Description": "The RDP Classifier is a naive Bayesian classifier that can rapidly and accurately provides taxonomic assignments from domain to genus, with confidence estimates for each assignment. Homepage"
 },
 {
   "Module": "relion",
   "Version": "2.1.b1",
   "Tag": "bio",
   "Description": "RELION (for REgularised LIkelihood OptimisatioN, pronounce rely-on) is a stand-alone computer program that employs an empirical Bayesian approach to refinement of (multiple) 3D reconstructions or 2D class averages in electron cryo-microscopy (cryo-EM). Homepage"
 },
 {
   "Module": "repast_hpc",
   "Version": "2.3.0",
   "Tag": "lang",
   "Description": "Repast for High Performance Computing (Repast HPC) is a next generation agent-based modeling system intended for large-scale distributed computing platforms. Homepage"
 },
 {
   "Module": "rsem",
   "Version": "1.3.0",
   "Tag": "bio",
   "Description": "RNA-Seq by Expectation-Maximization Homepage"
 },
 {
   "Module": "rstudio",
   "Version": "0.98.1103, 1.0.143",
   "Tag": "lang",
   "Description": "RStudio is a set of integrated tools designed to help you be more productive with R. Homepage"
 },
 {
   "Module": "ruby",
   "Version": "2.3.4",
   "Tag": "lang",
   "Description": "Ruby is a dynamic, open source programming language with a focus on simplicity and productivity. It has an elegant syntax that is natural to read and easy to write. Homepage"
 },
 {
   "Module": "sagemath",
   "Version": "8.0_test, 8.0-test, 8.0",
   "Tag": "math",
   "Description": "SageMath is a free open-source mathematics software system licensed under the GPL. It builds on top of many existing open-source packages: NumPy, SciPy, matplotlib, Sympy, Maxima, GAP, FLINT, R and many more Homepage"
 },
 {
   "Module": "salmon",
   "Version": "0.11.2",
   "Tag": "bio",
   "Description": "Salmon is a tool for quantifying the expression of transcripts using RNA-seq data. Salmon uses new algorithms (specifically, coupling the concept of quasi-mapping with a two-phase inference procedure) to provide accurate expression estimates very quickly (i.e. wicked-fast) and while using little memory. Homepage"
 },
 {
   "Module": "sambamba",
   "Version": "0.6.6",
   "Tag": "bio",
   "Description": "Sambamba is a tool for processing BAM files. Homepage"
 },
 {
   "Module": "samtools",
   "Version": "0.1.20, 1.4.1, 1.7, 1.9",
   "Tag": "bio",
   "Description": "SAM Tools provide various utilities for manipulating alignments in the SAM format, including sorting, merging, indexing and generating alignments in a per-position format. Homepage"
 },
 {
   "Module": "sas",
   "Version": "9.4",
   "Tag": "",
   "Description": "Statistical analysis package Homepage"
 },
 {
   "Module": "sbt",
   "Version": "1.1.0, 1.2.6",
   "Tag": "lang",
   "Description": "A build tool for Scala. Homepage"
 },
 {
   "Module": "scalapack",
   "Version": "2.0.2",
   "Tag": "numlib",
   "Description": "The ScaLAPACK (or Scalable LAPACK) library includes a subset of LAPACK routines redesigned for distributed memory MIMD parallel computers. Homepage"
 },
 {
   "Module": "scotch",
   "Version": "6.0.6",
   "Tag": "math",
   "Description": "Software package and libraries for sequential and parallel graph partitioning, static mapping, and sparse matrix block ordering, and sequential mesh and hypergraph partitioning. Homepage"
 },
 {
   "Module": "shengbte",
   "Version": "1.1.1",
   "Tag": "chem",
   "Description": "ShengBTE is a software package for solving the Boltzmann Transport Equation for phonons. Homepage"
 },
 {
   "Module": "sibil-env",
   "Version": "1.0.0",
   "Tag": "vis",
   "Description": "This module sets up the environment for the SIBIL application."
 },
 {
   "Module": "sicerpy",
   "Version": "0.1.1",
   "Tag": "bio",
   "Description": "SICER.py is a Python wrapper for the SICER peak caller software. Homepage"
 },
 {
   "Module": "siesta",
   "Version": "4.1-b2",
   "Tag": "chem",
   "Description": "SIESTA is both a method and its computer program implementation, to perform efficient electronic structure calculations and ab initio molecular dynamics simulations of molecules and solids. Homepage"
 },
 {
   "Module": "singularity",
   "Version": "2.6.1",
   "Tag": "containersystem",
   "Description": "Singularity enables users to have full control of their environment. Singularity containers can be used to package entire scientific workflows, software and libraries, and even data. Homepage"
 },
 {
   "Module": "slatec",
   "Version": "4.1",
   "Tag": "numlib",
   "Description": "Fortran 77 numerical library. Homepage"
 },
 {
   "Module": "slepc",
   "Version": "3.10.1",
   "Tag": "numlib",
   "Description": "SLEPc (Scalable Library for Eigenvalue Problem Computations) is a software library for the solution of large scale sparse eigenvalue problems on parallel computers. It is an extension of PETSc and can be used for either standard or generalized eigenproblems, with real or complex arithmetic. It can also be used for computing a partial SVD of a large, sparse, rectangular matrix, and to solve quadratic eigenvalue problems. Homepage"
 },
 {
   "Module": "smrtlink",
   "Version": "5.1.0.26412",
   "Tag": "bio",
   "Description": "PacBio’s open-source SMRT Analysis software suite is designed for use with Single Molecule, Real-Time (SMRT) Sequencing data. You can analyze, visualize, and manage your data through an intuitive GUI or command-line interface. You can also integrate SMRT Analysis in your existing data workflow through the extensive set of APIs provided Homepage"
 },
 {
   "Module": "snakemake",
   "Version": "5.2.2",
   "Tag": "tools",
   "Description": "The Snakemake workflow management system is a tool to create reproducible and scalable data analyses. Homepage"
 },
 {
   "Module": "snap",
   "Version": "2013-11-29",
   "Tag": "bio",
   "Description": "SNAP is a general purpose gene finding program suitable for both eukaryotic and prokaryotic genomes. SNAP is an acroynm for Semi-HMM-based Nucleic Acid Parser. Homepage"
 },
 {
   "Module": "soapdenovo2",
   "Version": "r240",
   "Tag": "bio",
   "Description": "SOAPdenovo is a novel short-read assembly method that can build a de novo draft assembly for human-sized genomes. The program is specially designed to assemble Illumina short reads. It creates new opportunities for building reference sequences and carrying out accurate analyses of unexplored genomes in a cost effective way. SOAPdenovo2 is the successor of SOAPdenovo. Homepage"
 },
 {
   "Module": "sparsehash",
   "Version": "2.0.3",
   "Tag": "lib",
   "Description": "An extremely memory-efficient hash_map implementation. 2 bits/entry overhead! The SparseHash library contains several hash-map implementations, including implementations that optimize for space or speed. Homepage"
 },
 {
   "Module": "spglib",
   "Version": "1.10.4",
   "Tag": "lib",
   "Description": "Spglib is a library for finding and handling crystal symmetries written in C. Homepage"
 },
 {
   "Module": "sprng",
   "Version": "2.0b",
   "Tag": "lib",
   "Description": "Scalable Parallel Pseudo Random Number Generators Library Homepage"
 },
 {
   "Module": "sqlite",
   "Version": "3.9.2, 3.13.0",
   "Tag": "devel",
   "Description": "SQLite: SQL Database Engine in a C Library Homepage"
 },
 {
   "Module": "sratoolkit",
   "Version": "2.8.0, 2.9.1",
   "Tag": "bio",
   "Description": "The SRA Toolkit, and the source-code SRA System Development Kit (SDK), will allow you to programmatically access data housed within SRA and convert it from the SRA format Homepage"
 },
 {
   "Module": "stacks",
   "Version": "1.48, 2.0",
   "Tag": "bio",
   "Description": "Stacks is a software pipeline for building loci from short-read sequences, such as those generated on the Illumina platform. Stacks was developed to work with restriction enzyme-based data, such as RAD-seq, for the purpose of building genetic maps and conducting population genomics and phylogeography. Homepage"
 },
 {
   "Module": "star",
   "Version": "2.5.3a",
   "Tag": "bio",
   "Description": "STAR aligns RNA-seq reads to a reference genome using uncompressed suffix arrays. Homepage"
 },
 {
   "Module": "stata",
   "Version": "12",
   "Tag": "math",
   "Description": "Stata is a complete, integrated statistical software package that provides everything you need for data analysis, data management, and graphics. Homepage"
 },
 {
   "Module": "suitesparse",
   "Version": "5.4.0",
   "Tag": "numlib",
   "Description": ""
 },
 {
   "Module": "sundials",
   "Version": "3.2.1, 4.0.2",
   "Tag": "math",
   "Description": "SUNDIALS: SUite of Nonlinear and DIfferential/ALgebraic Equation Solvers Homepage"
 },
 {
   "Module": "superlu",
   "Version": "5.2.1, 5.2.2",
   "Tag": "numlib",
   "Description": "SuperLU is a general purpose library for the direct solution of large, sparse, nonsymmetric systems of linear equations. Homepage"
 },
 {
   "Module": "superlu_mt",
   "Version": "3.1",
   "Tag": "numlib",
   "Description": "SuperLU is a general purpose library for the direct solution of large, sparse, nonsymmetric systems of linear equations. Homepage"
 },
 {
   "Module": "swig",
   "Version": "3.0.12",
   "Tag": "devel",
   "Description": "SWIG is a software development tool that connects programs written in C and C++ with a variety of high-level programming languages. Homepage"
 },
 {
   "Module": "tabix",
   "Version": "0.2.6",
   "Tag": "bio",
   "Description": "Generic indexer for TAB-delimited genome position files Homepage"
 },
 {
   "Module": "taudem",
   "Version": "5.3",
   "Tag": "geo",
   "Description": "TauDEM (Terrain Analysis Using Digital Elevation Models) is a suite of Digital Elevation Model (DEM) tools for the extraction and analysis of hydrologic information from topography as represented by a DEM. Homepage"
 },
 {
   "Module": "tensorflow",
   "Version": "1.6.0-py27, 1.6.0-py36, 1.12.0-py27, 1.12.0-py36",
   "Tag": "lib",
   "Description": "TensorFlow is an open-source software library for Machine Intelligence. Homepage"
 },
 {
   "Module": "tensorflow2",
   "Version": "1.3.0",
   "Tag": "lib",
   "Description": "TensorFlow is an open-source software library for Machine Intelligence. Homepage"
 },
 {
   "Module": "tensorflow3",
   "Version": "1.3.0",
   "Tag": "lib",
   "Description": "TensorFlow is an open-source software library for Machine Intelligence. Homepage"
 },
 {
   "Module": "thirdorder",
   "Version": "1.1.1-py3",
   "Tag": "chem",
   "Description": "Python package for creating input for ShengBTE. Homepage"
 },
 {
   "Module": "tmux",
   "Version": "2.5",
   "Tag": "tools",
   "Description": "tmux is a terminal multiplexer. It lets you switch easily between several programs in one terminal, detach them (they keep running in the background) and reattach them to a different terminal. Homepage"
 },
 {
   "Module": "tophat",
   "Version": "2.1.1",
   "Tag": "bio",
   "Description": "TopHat is a fast splice junction mapper for RNA-Seq reads. Homepage"
 },
 {
   "Module": "totalview",
   "Version": "2018.1.12",
   "Tag": "debugger",
   "Description": "TotalView is a GUI-based source code defect analysis tool that gives you unprecedented control over processes and thread execution and visibility into program state and variables. It allows you to debug one or many processes and/or threads in a single window with complete control over program execution. This allows you to set breakpoints, stepping line by line through the code on a single thread, or with coordinated groups of processes or threads, and run or halt arbitrary sets of processes or threads. You can reproduce and troubleshoot difficult problems that can occur in concurrent programs that take advantage of threads, OpenMP, MPI, GPUs or coprocessors. Homepage"
 },
 {
   "Module": "trimgalore",
   "Version": "0.4.5",
   "Tag": "bio",
   "Description": "Trim Galore is a wrapper around Cutadapt and FastQC to consistently apply adapter and quality trimming to FastQ files, with extra functionality for RRBS data. Homepage"
 },
 {
   "Module": "trimmomatic",
   "Version": "0.36",
   "Tag": "bio",
   "Description": "Trimmomatic performs a variety of useful trimming tasks for illumina paired-end and single ended data. Homepage"
 },
 {
   "Module": "ucsc-tools",
   "Version": "3.7.4",
   "Tag": "bio",
   "Description": "A set of genome utilities developed at the University of California Santa Cruz. Homepage"
 },
 {
   "Module": "udunits",
   "Version": "2.2.25",
   "Tag": "tools",
   "Description": "UDUNITS supports conversion of unit specifications between formatted and binary forms, arithmetic manipulation of units, and conversion of values between compatible scales of measurement. Homepage"
 },
 {
   "Module": "vapor",
   "Version": "2.6.0",
   "Tag": "vis",
   "Description": "VAPOR is the Visualization and Analysis Platform for Ocean, Atmosphere, and Solar Researchers. VAPOR provides an interactive 3D visualization environment that can also produce animations and still frame images Homepage"
 },
 {
   "Module": "vasp",
   "Version": "grads544",
   "Tag": "chem",
   "Description": "The Vienna Ab initio Simulation Package (VASP) is a computer program for atomic scale materials modelling. Homepage"
 },
 {
   "Module": "vcftools",
   "Version": "0.1.15",
   "Tag": "bio",
   "Description": "The aim of VCFtools is to provide easily accessible methods for working with complex genetic variation data in the form of VCF files. Homepage"
 },
 {
   "Module": "velvet",
   "Version": "1.2.10",
   "Tag": "bio",
   "Description": "Sequence assembler for very short reads Homepage"
 },
 {
   "Module": "vep",
   "Version": "90",
   "Tag": "bio",
   "Description": "VEP determines the effect of your variants (SNPs, insertions, deletions, CNVs or structural variants) on genes, transcripts, and protein sequence, as well as regulatory regions. Homepage"
 },
 {
   "Module": "vigra",
   "Version": "1.11.1",
   "Tag": "vis",
   "Description": "VIGRA stands for \"Vision with Generic Algorithms\". It's an image processing and analysis library that puts its main emphasis on customizable algorithms and data structures. VIGRA is especially strong for multi-dimensional images, because many algorithms (e.g. filters, feature computation, superpixels) are implemented for arbitrary high dimensions. Homepage"
 },
 {
   "Module": "vsearch",
   "Version": "2.7.1",
   "Tag": "bio",
   "Description": "VSEARCH which supports de novo and reference based chimera detection, clustering, full-length and prefix dereplication, rereplication, reverse complementation, masking, all-vs-all pairwise global alignment, exact and global alignment searching, shuffling, subsampling and sorting. It also supports FASTQ file analysis, filtering, conversion and merging of paired-end reads. Homepage"
 },
 {
   "Module": "vtk",
   "Version": "8.1.2",
   "Tag": "vis",
   "Description": "The Visualization Toolkit (VTK) is an open-source, freely available software system for 3D computer graphics, image processing and visualization. VTK consists of a C++ class library and several interpreted interface layers including Tcl/Tk, Java, and Python. VTK supports a wide variety of visualization algorithms including: scalar, vector, tensor, texture, and volumetric methods; and advanced modeling techniques such as: implicit modeling, polygon reduction, mesh smoothing, cutting, contouring, and Delaunay triangulation. Homepage"
 },
 {
   "Module": "wannier90",
   "Version": "2.1.0",
   "Tag": "chem",
   "Description": "Wannier90 is a package to calculate maximally-localised Wannier functions. Homepage"
 },
 {
   "Module": "wdltool",
   "Version": "0.14",
   "Tag": "tools",
   "Description": "A Java command-line tool co-developed with WDL that performs utility functions, including syntax validation and generation of input JSON templates. Homepage"
 },
 {
   "Module": "wxwidgets",
   "Version": "3.0.3",
   "Tag": "vis",
   "Description": "wxPython is a GUI toolkit for the Python programming language. It allows Python programmers to create programs with a robust, highly functional graphical user interface, simply and easily. It is implemented as a Python extension module (native code) that wraps the popular wxWidgets cross platform GUI library, which is written in C++. Homepage"
 },
 {
   "Module": "xcrysden",
   "Version": "1.5.60",
   "Tag": "vis",
   "Description": "XCrySDen is a crystalline and molecular structure visualisation program aiming at display of isosurfaces and contours, which can be superimposed on crystalline structures and interactively rotated and manipulated. Homepage"
 },
 {
   "Module": "xxdiff",
   "Version": "4.0.1",
   "Tag": "tools",
   "Description": "xxdiff is a graphical file and directories comparator and merge tool. Homepage"
 },
 {
   "Module": "xz",
   "Version": "5.2.3",
   "Tag": "tools",
   "Description": "xz: XZ utilities Homepage"
 },
 {
   "Module": "yasm",
   "Version": "1.3.0",
   "Tag": "lang",
   "Description": "Yasm: Complete rewrite of the NASM assembler with BSD license Homepage"
 },
 {
   "Module": "zlib",
   "Version": "1.2.11",
   "Tag": "lib",
   "Description": "zlib is designed to be a free, general-purpose, legally unencumbered -- that is, not covered by any patents -- lossless data-compression library for use on virtually any computer hardware and operating system. Homepage"
 }
]